using System;
using System.Collections.Generic;
using System.Linq;
using System.Runtime.InteropServices.ComTypes;
using System.Security.Permissions;
using System.Text;
using System.Threading.Tasks;

namespace Task_3_1_2
{
    class Program
    {
        static void Main(string[] args)
        {
            string text;
            int totalCount;
            Console.WriteLine("Введите текст:");
            //text = Console.ReadLine();
            text = "Устная передача — самый древний способ передачи знаний в истории человечества. После изобретения древними цивилизациями систем записи люди начали использовать для письма почти всё, на чём можно писать — глиняные таблички, кору дерева, листы металла и т. п. Таблички " +
                "Шумерская глиняная табличка с клинописью Табличку можно определить как физически прочный, надёжный носитель письменной информации, относительно удобный в повседневном использовании и транспортировке.Пишущим средством в этом случае, как правило, выступало стило.Можно выделить два основных типа табличек: глиняные" +
                "(например, у населения долины между Тигром и Евфратом), которые часто использовались для письма клинописью[4], и восковые.Последние представляли собой дощечки, покрытые слоем воска, в то время как глиняные полностью состояли из глины и после нанесения надписей часто" +
                " обжигались для придания им дополнительной прочности.После этой процедуры, соответственно, изменить текст было уже невозможно; напротив, записи на восковых табличках можно было стереть и использовать носитель повторно.В Древнем Риме дощечки часто скрепляли друг с" +
                " другом.Известно, что существовали «диптихи», «триптихи» и «полиптихи» (соответственно две, три и много дощечек)[5], образуя тем самым своеобразный прототип современной книги — кодекс[6]. Свитки Винченцо Фоппа.Юный Цицерон за книгой В Древнем Египте для записи, " +
                "со времён Первой Династии, использовался папирус(вид бумаги, сделанной из стеблей одноимённого растения). Однако первым свидетельством считают бухгалтерские книги царя Нефериркаре Какйя Пятой Династии(приблизительно 2400 лет до н.э). Отдельные листы папируса, " +
                "для удобства хранения, склеивались в свитки.Эта традиция получила широкое распространение в Эллинском и Римском мире, хотя есть свидетельства, что использовались так же древесная кора[7] и другие материалы.Технологию изготовления папируса описал в" +
                " «Естественной истории» (XIII. 11-13) Плиний Старший[8]. Согласно Геродоту(История 5:58), финикийцы принесли письменность и папирус в Грецию около X или IX века до н.э.Греческим словом для папируса как материала для записей стало «библион», а для книги — «библос»[9]" +
                "которое произошло от названия финикийского портового города Библос, через который папирус экспортировался в Грецию[10]. Чернила с поверхности папируса легко смывались и лист мог использоваться вторично для новых записей. Длинная полоса (по-гречески «хартия»)" +
                " склеенных листов папируса(обычно около 20) исписывалась с одной стороны.Папирусная полоса наматывалась на валик с ручками. При чтении надо было держать одной рукой валик, а другой разматывать свиток[11]. Кодексы Основная статья: Кодекс (книга) В V веке Исидор" +
                "Севильский разъяснял различия между книгой, свитком и кодексом в соответствии с существовавшими тогда представлениями следующим образом: кодекс составлен из множества книг, книга — из одного свитка.В современном понимании кодекс можно назвать первым носителем " +
                "информации, который характеризуется заметным сходством с книгой: страницы равнозначного размера тем или иным образом скреплены с одной стороны и заключены в обложку, изготовленную из некоторого достаточно прочного материала. Несмотря на свои положительные аспекты," +
                "кодексы не получили широкого распространения в эпоху античности и приобрели популярность уже в III—IV веках, в христианском обществе, когда для записей стал использоваться пергамен, который, в отличие от папируса, не ломался, когда его сгибали[12], его можно было " +
                "резать. Преимущества такого формата состояли в его экономичности (можно было использовать обе стороны носителя письменной информации), портативности и удобстве поиска сведений.Кроме того, пергамен — материал многократного применения: с него легко удаляется краска." +
                "Распространена была записная книжка из четырёх листов пергамена, согнутых и прошитых посередине, так получалось 16 страниц. Такая книжка по-гречески называлась «тетрада» («четвёрка»), современные книжные блоки собираются из 16-ти и 32-страничных тетрадей[5]." +
                "Книготорговля Основная статья: Книготорговля";
            text = text.ToLower();

            char[] separators = new char[] { '.', '!', '?', ' ', ',', '-', '—', '(', ')', '\"', '/', '[', ']', ';', ':', '«', '»' };
            string[] arr = text.Split(separators, StringSplitOptions.RemoveEmptyEntries);
            totalCount = arr.Length;

            Dictionary<string, int> dict = new Dictionary<string, int>();

            foreach (var word in arr)
            {
                if (word.Length < 3) // Выкидываем одно- или двухсимвольные союзы и предлоги
                    continue;
                if (!dict.ContainsKey(word)) // Если слова в словаре нет - добавляем
                {
                    dict.Add(word, 1);
                }
                else // Если слово уже присутствует - прибавляем количество вхождений
                    dict[word]++;
            }
            arr = null; // Очищаем память

            dict = dict.OrderByDescending(pair => pair.Value).ToDictionary(pair => pair.Key, pair => pair.Value); // Сортируем по значению в порядке убывания

            Console.WriteLine($"Всего слов в тексте: {totalCount}. 5 наиболее часто встречающихся слов:");
            for (int i = 0; i < 5; i++)
            {
                if (dict.ElementAt(i).Value > 1)
                    Console.WriteLine("{0, -14}|{1, -14}", dict.ElementAt(i).Key, dict.ElementAt(i).Value);
            }
            float q = (float)dict.ElementAt(0).Value * 100 / totalCount;
            Console.WriteLine($"Наиболее популярное слово в тексте: \"{dict.ElementAt(0).Key}\".\nПроцент его вхождений от общего числа слов составляет ~ {q:0.0}%");
            if (q < 5)
                Console.WriteLine("Что является приемлемым результатом. Текст в корректировке не нуждается.");
            else
                Console.WriteLine("Автору следует обратиться к словарю синонимов чтобы разннобразить текст");
        }
    }
}
