using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task_1_1_5 // SUM OF NUMBERS
{
    class Program
    {
        static void Main(string[] args)
        {
            const UInt16 num = 1000;

            UInt32 sum1 = 0, sum2 = 0;
            
            // Первый вариант, который приходит в голову
            for (UInt16 i = 1; i < num; i++)
            {
                if (i % 3 == 0 || i % 5 == 0)
                //if (i % 5 == 0)
                    sum1 += i;
            }
            ////////////////////////////////////////////

            // Второй, более извращенный вариант, рожденный сонным мозгом
            // Здесь, примерно, в 3 раза меньше итераций, но больше вычислений и 3 лишних байта ОЗУ,
            // а также нечитаемый код :)
            // Может быть будет работать быстрее (но это не точно).
            UInt16 mult;
            bool flag5 = true;

            for (UInt16 i = 1; i <= (num - 1) / 3; i++) // Максимальное число итераций будет при делении исходного числа на 3, нежели чем на 5
            {
                //mult = (UInt16) (i * 3);
                //sum2 += mult;
                sum2 += (UInt16)(i * 3);

                // Когда i*5 станет больше 999 (т.к. по условию "сумму всех чисел меньше 1000"), выполнять лишние вычмсления нет необходимости.
                // Также не забываем исключить i, кратное 3, чтобы не дублировать числа, кратные и 3, и 5
                
                //if (flag5 && i%3 != 0 ) // Разделил на вложенные if'ы, чтобы не проверять i на кратность 3-м тогда, когда флаг5 уже равен false
                if (flag5)
                {
                    if (i % 3 != 0)
                    {
                        mult = (UInt16)(i * 5);
                        if (mult > num - 1)
                            flag5 = false;
                        else
                            sum2 += mult;
                    }
                }
            }
            /////////////////////////////////////////////////////////////
            Console.WriteLine("Сумма чисел, кратных 3 или 5 меньше 1000 равна:\nВариант 1 " + sum1 + "\nВариант 2 " + sum2);
        }
    }
}
